import Link from "next/link";
import RootLayout from "../../components/layout";

const ReadBlogsDetail = () => {
  return (
    <RootLayout>

      <div className="relative p-7 md:p-3">
        <div className="w-full md:w-3/5 mx-auto ">
          <div className="mx-5 my-3 text-sm">
            <Link href="/blogs" className=" font-bold tracking-widest underline text-white">
              กลับ
            </Link>
          </div>
          <div className="w-full text-2xl md:text-4xl px-5 font-bold leading-none py-2 text-white">
            การ์ดจอคืออะไร อีกหนึ่ง Item ชิ้นสำคัญ ที่ชาวเกมเมอร์ทุกคนต้องมี
          </div>
          <p className="text-end text-white">18-08-2023</p>
          <img className="" src="/images/gpu.jpg" alt="" />
          <p className="text-lg md:text-xl text-white py-2">ในปัจจุบันถ้าใครต้องการที่จะประกอบคอมพิวเตอร์ใช้เองขึ้นมาสักหนึ่งเครื่อง Item ชิ้นสำคัญที่หลายๆคนให้ความสนใจ และสำหรับบางคน นี่อาจเป็นอุปกรณ์ชิ้นแรกที่มองหาด้วยซ้ำ สิ่งที่เรากำลังพูดถึงกันอยู่ นั่นก็คือการ์ดจอนั่นเอง ด้วยปัจจัยหลายๆอย่าง ทำให้การ์ดจอขาดตลาด ไม่ว่าจะเป็นจากการที่ชิ้นส่วนหรือวัตถุดิบที่ใช้ในการผลิต อยู่ในภาวะขาดตลาดจากภาวะการระบาดของ Covid-19 หรือว่าจะเป็นการกว้านซื้อ เพื่อไปทำการขุดเหมือง Cryptocurrency เหตุผลเหล่านี้ ล้วนส่งเสริมให้ราคาการ์ดจอต่างก็เคยพุ่งทะยานไปมาก เพื่อนๆเคยสงสัยกันหรือไม่ ว่าทำไมการ์ดจอถึงได้เป็นที่ต้องการของทุกคนถึงขนาดนี้ ในวันนี้เราจะพาไปไขข้อสงสัยว่าการ์ดจอคืออะไร ทำไมไม่ใช่แค่เฉพาะชาวเกมเมอร์ ต้องการจะครอบครอง Item ชิ้นนี้</p>
          <img className="" src="/images/gpu.jpg" alt="" />
          <p className=" text-white text-xl">
            การ์ดจอคืออะไร
            การ์ดจอ (Graphic Card) หรือที่หลายๆคนเรียกว่า GPU เป็นอุปกรณ์ที่สำคัญอีกชิ้นของคอมพิวเตอร์ ซึ่งแนวคิดในการสร้างนั้นก็คือช่วย CPU ประมวลผลหรือชุดคำสั่งที่ออกมาเป็นสัญญาณภาพนั่นเอง โดยจะแสดงผลผ่านจอคอมพิวเตอร์ ไม่ว่าจะเป็นภาพหรือตัววิดีโอก็ตาม โดยถ้าถามว่าการประมวลผลเหล่านี้ CPU สามารถทำได้ไหม ก็ต้องตอบว่าทำได้ แต่ด้วยภาระงานของ CPU ที่จะต้องประมวล และควบคุมการทำงานของเครื่องคอมพิวเตอร์ทั้งหมด การที่จะต้องมาประมวลผลด้านภาพด้วย จึงอาจทำให้การทำงานต่างๆนั้นช้าลง นั้นจึงทำให้การ์ดจอถือกำเนิดขึ้นมานั้นเอง
            ซึ่งถ้าเทียบกับคอมพิวเตอร์ การ์ดจอจะมีสิ่งที่คอยประมวลผลคล้ายกับ CPU ของคอมพิวเตอร์ที่เรียกว่า GPU โดยที่ความสามารถในด้านการประมวลผล อาจจะไม่ได้ดีเท่า CPU แต่สิ่งที่เหนือกว่าจนทิ้งแทบไม่เห็นฝุ่น นั้นก็คือจำนวน Core นั่นเอง เนื่องจากงานทางด้าน Graphic เป็นงานประมวลชุดคำสั่งเพียงอย่างเดียว จึงเน้นไปที่การสร้าง Core เพื่อช่วยในการประมวลผลให้กับ GPU แทน ลองนึกภาพว่าถ้าเพื่อนๆต้องการเล่นเกม ที่มีภาพความละเอียดที่คมชัด FHD และ ใน 1 วินาทีต้องการภาพ 60 fps จะต้องใช้การประมวลผลแค่ไหน ดังนั้นการมีจำนวน Core มากจึงช่วยทำให้การประมวลผลได้ดีและมีประสิทธิภาพ
            ซึ่ง Core นี้ก็มีชื่อเรียกเฉพาะที่ต่างกันออกไปของ 2 ค่ายการ์ดจอ โดยที่ค่ายเขียวอย่าง Nvidia จะเรียกว่า CUDA ส่วนในฝั่งแดงอย่าง AMD จะเรียกว่า Stream Processor ถึงแม้ชื่อจะต่างกัน แต่มันคือสิ่งเดียวกันนั่นเอง และด้วยการที่การ์ดจอเป็นเซียนด้านประมวลผลคำนวญชุดคำสั่งนี่เอง จึงทำให้เป็นเป็นที่ต้องการของคนอีกกลุ่มหนึ่ง ที่ต้องการจะนำไปใช้ขุดเหมือง Cryptocurrency ที่ต้องใช้การเจาะรหัสประมวลมล จนการ์ดจอถูกกว้านซื้อไปจากตลาดเป็นจำนวนมากนั่นเอง ถ้าจะให้สรุปอย่างง่ายๆที่สุดการ์ดจอคืออุปกรณ์ ที่รับหน้าที่ในการประมวลผลด้าน Graphic ให้ได้ภาพที่สวยงาม
          </p>
        </div>
      </div>

    </RootLayout>
  )
}
export default ReadBlogsDetail;